In [1]:
import numpy as np
import pandas as pd
import datetime as dt

In [2]:
df_gameplayed = pd.read_csv('User Gameplayed Data.csv')
df_deposite = pd.read_csv('Deposite Data.csv')
df_withdraw = pd.read_csv('Withdrawal Data.csv')

In [3]:
df_gameplayed.head()

   User ID  Games Played        Datetime
0      851             1  1/10/2022 0:00
1      717             1  1/10/2022 0:00
2      456             1  1/10/2022 0:00
3      424             1  1/10/2022 0:00
4      845             1  1/10/2022 0:00

In [4]:
df_gameplayed.shape

(355266, 3)

In [5]:
df_deposite.head()

   User Id        Datetime  Amount
0      357  1/10/2022 0:03    2000
1      776  1/10/2022 0:03    2500
2      492  1/10/2022 0:06    5000
3      803  1/10/2022 0:07    5000
4      875  1/10/2022 0:09    1500

In [6]:
df_deposite.shape

(17438, 3)

In [7]:
df_withdraw.head()

   User Id        Datetime  Amount
0      190  1/10/2022 0:03    5872
1      159  1/10/2022 0:16    9540
2      164  1/10/2022 0:24     815
3      946  1/10/2022 0:29   23000
4      763  1/10/2022 0:40    9473

In [8]:
df_withdraw.shape

(3566, 3)

In [9]:
df_gameplayed.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 355266 entries, 0 to 355265
Data columns (total 3 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   User ID       355266 non-null  int64
 1   Games Played  355266 non-null  int64
 2   Datetime      355266 non-null  object
dtypes: int64(2), object(1)
memory usage: 8.1+ MB

In [10]:
df_deposite.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17438 entries, 0 to 17437
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   User Id   17438 non-null  int64
 1   Datetime  17438 non-null  object
 2   Amount    17438 non-null  int64
dtypes: int64(2), object(1)
memory usage: 408.8+ KB

In [11]:
df_withdraw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3566 entries, 0 to 3565
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   User Id   3566 non-null   int64
 1   Datetime  3566 non-null   object
 2   Amount    3566 non-null   int64
dtypes: int64(2), object(1)
memory usage: 83.7+ KB

In [12]:
df_gameplayed.isnull().sum()

User ID         0
Games Played    0
Datetime        0
dtype: int64

In [13]:
df_deposite.isnull().sum()

User Id     0
Datetime    0
Amount      0
dtype: int64

In [14]:
df_withdraw.isnull().sum()

User Id     0
Datetime    0
Amount      0
dtype: int64

In [15]:
df_gameplayed['Datetime'].dtype

dtype('O')

Convert datetime's object datatype in proper datetime

In [16]:
df_gameplayed['Datetime'] = pd.to_datetime(df_gameplayed['Datetime'], dayfirst=True, errors='coerce')

In [17]:
df_gameplayed['Datetime'].dtype

dtype('<M8[ns]')

In [18]:
df_deposite['Datetime'] = pd.to_datetime(df_deposite['Datetime'], dayfirst=True, errors='coerce')

In [19]:
df_deposite['Datetime'].dtype

dtype('<M8[ns]')

In [20]:
df_withdraw['Datetime'] = pd.to_datetime(df_withdraw['Datetime'], dayfirst=True, errors='coerce')

In [21]:
df_withdraw['Datetime'].dtype

dtype('<M8[ns]')

Extracting hour column to identify  slots s1 and s2

In [22]:
df_gameplayed['Hour'] = df_gameplayed['Datetime'].dt.hour
df_gameplayed.head(20)

    User ID  Games Played            Datetime  Hour
0       851             1 2022-10-01 00:00:00   0.0
1       717             1 2022-10-01 00:00:00   0.0
2       456             1 2022-10-01 00:00:00   0.0
3       424             1 2022-10-01 00:00:00   0.0
4       845             1 2022-10-01 00:00:00   0.0
5        15             1 2022-10-01 00:00:00   0.0
6       738             1 2022-10-01 00:00:00   0.0
7       748             1 2022-10-01 00:01:00   0.0
8       582             1 2022-10-01 00:01:00   0.0
9        39             1 2022-10-01 00:01:00   0.0
10      564             1 2022-10-01 00:01:00   0.0
11      996             1 2022-10-01 00:01:00   0.0
12      146             1 2022-10-01 00:02:00   0.0
13      458             1 2022-10-01 00:02:00   0.0
14       39             1 2022-10-01 00:02:00   0.0
15      247             1 2022-10-01 00:02:00   0.0
16      137             1 2022-10-01 00:02:00   0.0
17      618             1 2022-10-01 00:02:00   0.0
18      754             1 2022-10-01 00:02:00   0.0
19      365             1 2022-10-01 00:02:00   0.0

In [23]:
df_deposite['Hour'] = df_deposite['Datetime'].dt.hour
df_deposite.head()

   User Id            Datetime  Amount  Hour
0      357 2022-10-01 00:03:00    2000   0.0
1      776 2022-10-01 00:03:00    2500   0.0
2      492 2022-10-01 00:06:00    5000   0.0
3      803 2022-10-01 00:07:00    5000   0.0
4      875 2022-10-01 00:09:00    1500   0.0

In [24]:
df_withdraw['Hour'] = df_withdraw['Datetime'].dt.hour
df_withdraw.head(90)

    User Id            Datetime  Amount  Hour
0       190 2022-10-01 00:03:00    5872   0.0
1       159 2022-10-01 00:16:00    9540   0.0
2       164 2022-10-01 00:24:00     815   0.0
3       946 2022-10-01 00:29:00   23000   0.0
4       763 2022-10-01 00:40:00    9473   0.0
..      ...                 ...     ...   ...
85        2 2022-10-01 18:03:00   55000  18.0
86      471 2022-10-01 18:05:00     250  18.0
87      246 2022-10-01 18:14:00    5000  18.0
88      380 2022-10-01 18:15:00    7000  18.0
89      972 2022-10-01 18:17:00    3500  18.0

[90 rows x 4 columns]

Assign S1 slot for 12am to 12pm and S2 for 12pm to 12am

In [25]:
df_gameplayed['Slot'] = df_gameplayed['Hour'].apply(lambda x: 'S1' if x<12 else 'S2')

In [26]:
df_deposite['Slot'] = df_deposite['Hour'].apply(lambda x:'S1' if x<12 else 'S2')

In [27]:
df_withdraw['Slot'] = df_withdraw['Hour'].apply(lambda x: 'S1' if x<12 else 'S2')

Now, to find playerwise loyalty points extract the date from each set and filter it slotwise

In [28]:
df_gameplayed['Date'] = df_gameplayed['Datetime'].dt.date
df_deposite['Date'] = df_deposite['Datetime'].dt.date
df_withdraw['Date'] = df_withdraw['Datetime'].dt.date

1. Find Playerwise Loyalty points earned by Players in the following slots:-
    a. 2nd October Slot S1
    b. 16th October Slot S2
    b. 18th October Slot S1
    b. 26th October Slot S2

In [29]:
gameplayed_2oct_s1 = df_gameplayed[(df_gameplayed['Date'] == dt.date(2022, 10, 2)) & (df_gameplayed['Slot'] == 'S1')]
gamepalyed_16oct_s2 = df_gameplayed[(df_gameplayed['Date'] == dt.date(2022,10,16)) & (df_gameplayed['Slot']=='S2')]
gameplayed_18oct_s1 = df_gameplayed[(df_gameplayed['Date'] == dt.date(2022,10,18)) & (df_gameplayed['Slot']=='S1')]
gameplayed_26oct_s2 = df_gameplayed[(df_gameplayed['Date'] == dt.date(2022,10,26)) & (df_gameplayed['Slot']=='S2')]

In [30]:
deposite_2oct_s1 = df_deposite[(df_deposite['Date'] == dt.date(2022,10,2)) & (df_deposite['Slot']=='S1')]
deposite_16oct_s2 = df_deposite[(df_deposite['Date']==dt.date(2022,10,16)) & (df_deposite['Slot']=='S2')]
deposite_18oct_s1 = df_deposite[(df_deposite['Date']== dt.date(2022,10,18)) & (df_deposite['Slot']=='S1')]
deposite_26oct_s2 = df_deposite[(df_deposite['Date']== dt.date(2022,10,26)) & (df_deposite['Slot']=='S2')]

In [31]:
withdraw_2oct_s1 = df_withdraw[(df_withdraw['Date']==dt.date(2022,10,2)) & (df_withdraw['Slot']=='S1')]
withdraw_16oct_s2 = df_withdraw[(df_withdraw['Date']==dt.date(2022,10,16)) & (df_withdraw['Slot']=='S2')]
withdraw_18oct_s1 = df_withdraw[(df_withdraw['Date'] == dt.date(2022,10,18)) & (df_withdraw['Slot']=='S1')]
withdraw_26oct_s2 = df_withdraw[(df_withdraw['Date'] == dt.date(2022,10,26)) & (df_withdraw['Slot']=='S2')]

In [32]:
df_gameplayed.rename(columns={'User ID':'User Id'}, inplace=True)

In [33]:
df_gameplayed.columns

Index(['User Id', 'Games Played', 'Datetime', 'Hour', 'Slot', 'Date'], dtype='object')

Group each dataframe by slot, date and userId

In [34]:
gameplayed_grouped = df_gameplayed.groupby(['User Id', 'Date', 'Slot'])['Games Played'].sum().reset_index()

In [35]:
deposite_grouped = df_deposite.groupby(['User Id','Date','Slot'])['Amount'].agg(['sum','count']).reset_index()

In [36]:
deposite_grouped.columns = ['User Id','Date','Slot','Deposite Amount','Num Deposite']

In [37]:
deposite_grouped.head()

   User Id        Date Slot  Deposite Amount  Num Deposite
0        2  2022-10-01   S2            40000             1
1        2  2022-10-02   S2             5000             1
2        2  2022-10-06   S1            40000             1
3        2  2022-10-08   S1            45000             2
4        2  2022-10-08   S2             5000             1

In [38]:
withdraw_grouped = df_withdraw.groupby(['User Id','Date','Slot'])['Amount'].agg(['sum','count']).reset_index()

In [39]:
withdraw_grouped.columns = ['User Id','Date','Slot','Withdrawal Amount','Num withdraw']

In [40]:
withdraw_grouped.head()

   User Id        Date Slot  Withdrawal Amount  Num withdraw
0        2  2022-10-01   S2              55000             1
1        2  2022-10-03   S1             117349             1
2        2  2022-10-04   S2              19000             1
3        2  2022-10-05   S1              36000             1
4        2  2022-10-08   S2              13000             1

Merge All three datasets

In [41]:
merged_one = pd.merge(withdraw_grouped,deposite_grouped, on=['User Id','Date','Slot'], how='outer')

In [42]:
merged_data = pd.merge(merged_one, gameplayed_grouped, on=['User Id','Date','Slot'], how='outer')

Fill the null values with 0

In [43]:
merged_data.fillna(0, inplace=True)

In [44]:
merged_data.head()

,User Id,Date,Slot,Withdrawal Amount,Num withdraw,Deposite Amount,Num Deposite,Games Played
0,0,2022-10-04,S2,0.0,0.0,0.0,0.0,1.0
1,0,2022-10-05,S2,0.0,0.0,0.0,0.0,1.0
2,0,2022-10-06,S1,0.0,0.0,0.0,0.0,1.0
3,0,2022-10-10,S1,0.0,0.0,0.0,0.0,1.0
4,0,2022-10-10,S2,0.0,0.0,0.0,0.0,1.0

In [45]:
merged_data['Loyalty_Point'] = (0.01 * merged_data['Deposite Amount'] + 
                                0.005 * merged_data['Withdrawal Amount'] + 
                                0.001 * (merged_data['Num Deposite'] - merged_data['Num withdraw']).clip(lower=0) +
                                0.2 * merged_data['Games Played'])

In [46]:
merged_data['Loyalty_Point'].head(10)

0      0.2
1      0.2
2      0.2
3      0.2
4      0.2
5      0.4
6      0.2
7      0.2
8      0.4
9    675.2
Name: Loyalty_Point, dtype: float64

Group the playerwise loyalty points

In [47]:
total_points = merged_data.groupby('User Id').agg({'Loyalty_Point':'sum', 'Games Played':'sum'}).reset_index()

In [48]:
total_points

     User Id  Loyalty_Point  Games Played
0          0          1.400           7.0
1          1          0.400           2.0
2          2       4325.552          34.0
3          3        105.401          27.0
4          4         17.501           0.0
..       ...            ...           ...
978      995          1.200           6.0
979      996        402.410         177.0
980      997          9.000          45.0
981      998         21.202           1.0
982      999         34.201          71.0

[983 rows x 3 columns]

Rank the players

In [49]:
total_points['Rank'] = total_points.sort_values(by=['Loyalty_Point','Games Played'],ascending=[False, False]).reset_index(drop=True).index+1

In [50]:
total_points.head()

   User Id  Loyalty_Point  Games Played  Rank
0        0          1.400           7.0     1
1        1          0.400           2.0     2
2        2       4325.552          34.0     3
3        3        105.401          27.0     4
4        4         17.501           0.0     5

Calculating average deposit amount

In [51]:
avg_deposite_amount = df_deposite['Amount'].mean()
print("average deposit amount : ",avg_deposite_amount)

average deposit amount :  5492.185399701801

Calculating average deposit amount per user in a month

In [52]:
oct_deposite = df_deposite[df_deposite['Datetime'].dt.month==10]
oct_deposite.head()

   User Id            Datetime  Amount  Hour Slot        Date
0      357 2022-10-01 00:03:00    2000   0.0   S1  2022-10-01
1      776 2022-10-01 00:03:00    2500   0.0   S1  2022-10-01
2      492 2022-10-01 00:06:00    5000   0.0   S1  2022-10-01
3      803 2022-10-01 00:07:00    5000   0.0   S1  2022-10-01
4      875 2022-10-01 00:09:00    1500   0.0   S1  2022-10-01

In [53]:
monthly_deposite = oct_deposite.groupby(df_deposite['User Id'])['Amount'].sum()

In [54]:
monthly_deposite

User Id
2      225000
3       10000
4        1750
5       20100
6        9000
        ...
992    119990
994      1400
996     36700
998      2100
999      2000
Name: Amount, Length: 796, dtype: int64

Calculating average number of games played per user

In [55]:
gameplayed_per_user = df_gameplayed.groupby(df_gameplayed['User Id'])['Games Played'].sum()

In [56]:
avg_gameplayed_per_user = gameplayed_per_user.mean()
avg_gameplayed_per_user

np.float64(355.267)

Rank top 50 players

In [98]:
top_50 = total_points[total_points['Rank']<=50].round(2).copy()

In [99]:
top_50

    User Id  Loyalty_Point  Games Played  Rank
0         0           1.40           7.0     1
1         1           0.40           2.0     2
2         2        4325.55          34.0     3
3         3         105.40          27.0     4
4         4          17.50           0.0     5
5         5         337.12         163.0     6
6         6          94.80          24.0     7
7         7           4.80          24.0     8
8         8          37.00         185.0     9
9         9        1600.07        1325.0    10
10       10         181.07         265.0    11
11       11         376.90         297.0    12
12       12         350.75          76.0    13
13       13          50.00           0.0    14
14       14          46.81           9.0    15
15       15          53.00          15.0    16
16       16        2449.57         815.0    17
17       17         123.81          94.0    18
18       18          54.60           3.0    19
19       19          34.40          22.0    20
20       20          50.20           1.0    21
21       21           6.40          32.0    22
22       22          10.40           2.0    23
23       23         287.50          81.0    24
24       24         263.21          91.0    25
25       25         167.50           0.0    26
26       26          28.00           0.0    27
27       27        1411.91         730.0    28
28       28        4463.02          15.0    29
29       29          41.00           5.0    30
30       30        3350.82           4.0    31
31       31         490.66         399.0    32
32       32         121.76          14.0    33
33       33         130.20           1.0    34
34       34           0.60           3.0    35
35       35           0.20           1.0    36
36       36         161.00          30.0    37
37       37           1.80           9.0    38
38       38           0.20           1.0    39
39       39        1442.50        1627.0    40
40       40           0.40           2.0    41
41       41          30.60           3.0    42
42       42         227.40         162.0    43
43       43          85.40         427.0    44
44       44         139.24           4.0    45
45       45         305.22          76.0    46
46       46         493.00          15.0    47
47       47         920.06         148.0    48
48       48           0.80           4.0    49
49       49          30.20           1.0    50

Distribute 50000 to top 50 players

In [100]:
total_top50_loyalty_points = top_50['Loyalty_Point'].sum().round(2)
total_top50_loyalty_points

np.float64(24906.15)

In [103]:
top_50['bonus in rupees'] = (top_50['Loyalty_Point']/total_top50_loyalty_points)*50000

In [104]:
top_50.head()

   User Id  Loyalty_Point  Games Played  Rank  bonus in rupees
0        0           1.40           7.0     1         2.810551
1        1           0.40           2.0     2         0.803015
2        2        4325.55          34.0     3      8683.698605
3        3         105.40          27.0     4       211.594325
4        4          17.50           0.0     5        35.131885

In [105]:
top_50_sort = top_50.sort_values(by='bonus in rupees',ascending=False).round(2)

In [106]:
top_50_sort.to_csv('Top_50_Bonus_LeaderBoard.csv', index=False)

The loyalty formula is slight unfair like someone active only once but with a large deposit still gets high points.A flat formula gives same reward to everyone regardless of pattern.

Suggestion : Reward more who  have higher deposite or add bonus who are active in most of the days

Loyalty Points =(0.01 × deposit) + (0.001 × max(#deposits - #withdrawals, 0)) + (0.2 × games_played) + (10 if active_days ≥ 10 else 0) - (0.002 × withdrawal)